# ModelGraphicsStyleAnonDraft Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ModelGraphicsStyleAnonDraft Property
ParameterTypeId Class See Also
---
"Visual Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ModelGraphicsStyleAnonDraft { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ModelGraphicsStyleAnonDraft As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ModelGraphicsStyleAnonDraft {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace